const qnaList = [
    {
      q: '드넓은 하얀 설원 속 당신의 눈을 사로 잡은 것은?',
      a: [
        { answer: '나란하게 맞춰 걸은 두 발자국', type: ["로맨스"] },
        { answer: '누구의 것인지 알 수 없는 혈흔 자국', type: ["스릴러/액션", "호러"] },
        { answer: '곧 파티가 열린다며 달려오는 토끼', type: ["애니메이션","SF/판타지"] },
      ]
    },
    {
      q: '유투브 프리미엄을 결제한 당신! 지금 당장 보고 싶은 영상은?',
      a: [
        { answer: 'a. 사람냄새 가득한 브이로그', type: ["코미디", "다큐멘터리", "로맨스"] },
        { answer: 'b. 세계 각지에 벌어진 사건사고와  트렌드', type: ["스릴러/액션", "다큐멘터리","호러"] },
        { answer: 'c. 어릴 적에 봤던 만화', type: ["애니메이션"] },
      ]
    },
    {
      q: '3. 다음 중 단 한가지만 가질 수 있다면?',
      a: [
        { answer: 'a. 사랑과 관계', type: ["코미디", "로맨스", "드라마"] },
        { answer: 'b. 공상과 즐거움', type: ["SF/판타지", "코미디", "애니메이션"] },
              { answer: 'c. 커리어 및 명예', type: ["스릴러/액션", "다큐멘터리"] },
      ]
    },
    {
      q: '4. 어두운 골목에 깜박이는 가로등 밑에 있는 것은?',
      a: [
        { answer: 'a. 드문 드문 수다 떨며 웃는 두 사람', type: ["코미디", "로맨스", "드라마"] },
        { answer: 'b. 차 안에서 잠복 근무하는 형사', type: ["스릴러/액션"] },
              { answer: 'c. 밟아도 죽지 않는 벌레', type: ["다큐멘터리", "SF/판타지"] },
      ]
    },
    {
      q: '5. 오랜만에 외출한 백수인 당신이 간 곳은?',
      a: [
        { answer: 'a. 친한 친구의 결혼식', type: ["로맨스"] },
        { answer: 'b. 멸종된 약초가 자라고 있는 뒷동산', type: ["다큐멘터리", "SF/판타지"] },
              { answer: 'c. 술 취한 친구가 자고 있는 경찰서', type: ["스릴러/액션"] },
      ]
    },
    {
      q: '6. 긴 휴가를 갖게 된 당신이 선택할 여행지는?',
      a: [
        { answer: 'a. 호캉스', type: ["코미디", "드라마"] },
        { answer: 'b. 나만 아는 여행지', type: ["다큐멘터리", "SF/판타지"] },
              { answer: 'c. 화려한 해외 여행', type: ["스릴러/액션"] },
      ]
    },
  {
      q: '7. 놀이공원에 놀러가서 당장 탈 놀이 기구는?',
      a: [
        { answer: 'a. 아마존 익스프레스, 스릴라이드, 사파리 투어', type: ["다큐멘터리"] },
        { answer: 'b. 롤러코스터, 자이로드랍', type: ["스릴러/액션", "호러"] },
              { answer: 'c. 회전목마, 관람차', type: ["코미디", "로맨스", "애니메이션"] },
      ]
    },
  {
      q: '8. 인간인 줄 알았던 상대가 로봇이었다면?',
      a: [
        { answer: 'a. 일단 친하게 지낸다.', type: ["로맨스", "애니메이션", "SF/판타지"] },
        { answer: 'b. 제보한다.', type: ["스릴러/액션"] },
      ]
    },
  
  {
      q: '9. 슈퍼 컴퓨터를 갖게 된 당신이 제일 먼저 하는 일은?',
      a: [
        { answer: 'a. 관심있는 사람의 계정을 훔쳐본다.', type: ["로맨스"] },
        { answer: 'b. 출석 번호를 해킹하여 출석하고 집에서 쉰다.', type: ["SF/판타지"] },
              { answer: 'c. 빼돌리고 팔아서 억만장자가 된다', type: ["스릴러/액션"] },
      ]
    },
  {
      q: '10. 내 마음대로 내 세계를 재창조 할 수 있다면??',
      a: [
        { answer: 'a. 평소 내가 상상하던 나만의 세계로 간다.', type: ["애니메이션", "SF/판타지"] },
        { answer: 'b. 내가 이전에 보고 듣고 경험한 것들로 현실을 재구성한다.', type: ["다큐멘터리", "스릴러/액션", "드라마"] },
      ]
    },
  {
      q: '11. 드디어 시험이 끝나 여유로운 당신이 스트레스를 풀고자 하는 일은??',
      a: [
        { answer: 'a. 친구들을 만나 재미있는 이야기를 한다.', type: ["코미디", "로맨스"] },
        { answer: 'b. 매운 음식을 먹으며 눈물 콧물 쏙 뺀다.', type: ["스릴러/액션", "호러"] },
      ]
    }
]