const genreList = {
    "thriller/action":{
      name: ' 도파민 폭발! 짜릿한 스릴러/액션',
      desc: '선을 넘을 듯 말듯 아슬아슬한 스릴을 즐기는 당신! 엄선된 거장들의 영화를 통해 짜릿한 쾌감을 느껴 보세요.',
      rec : [{name:"쿠앤틴 타란티노", movie:["킬빌", "저수지의 개들"]}, 
                {name:"알프레드 히치콕", movie:["사이코", "현기증"]}],
        url:"../../img/action.svg"
    },
   "comedy": {
      name: '가볍게 웃으며 볼 수 있는 코미디',
      desc: '각박한 현실 속에서도 웃음을 통해 행복을 느끼는 당신! 행복은 멀리에 있지 않아요. 가볍게 즐길 수 있는 코미디 영화로 당신만의 행복을 찾아 보세요!',
      rec : [{name:"강형철", movie:["써니", "과속스캔들", "스윙키즈"]}],
      url:"../../img/comedy.svg"
    },
    "romance":{
        name:"달콤 한 스푼 순정 두 스푼 로맨스",
        desc:"우여곡절 끝에 결국 이어지는 두 주인공을 보며 대리 설렘을 느끼고 있지는 않나요? 달콤한 로맨스 영화로 운명적인 사랑을 꿈꿔 보세요.",
        rec : [{name:"왕가위", movie:["중경삼림","타락천사","화양연화"]}, {name:"곽재용", movie:["엽기적인그녀","클래식","내여자친구를소개합니다"]}],
        url:"../../img/drama.svg"
    },
   "drama":{
        name:"눈물 촉촉해지는 드라마",
        desc:"스토리가 주는 아름다움을 사랑하며 남다른 감수성을 가진 당신! 감동적인 드라마 장르의 영화와 함께 감성의 바다로 풍덩 빠져 보세요. ",
        rec : [{name:"최국희", movie:["국가부도의날","인생은 아름다워"]}, {name:"이준익", movie:["사도","동주","자산어보"]}],
        url:"../../img/drama.svg"
    },
    "SF/fantasy":{
        name:"환상의 세계로 빠져드는 판타지/SF",
        desc:"흥미진진하고 새로운 것들에 관심이 많은 당신! 톡톡 튀는 특별함과 상상력으로 무장한 영화가 당신의 갈증을 채워줄거예요",
        rec : [{name:"제임스 카메론", movie:["아바타","인생은 아름다워"]}, {name:"크리스토퍼 놀란", movie:["인셉션","인터스텔라"]}],
        url:"../../img/sf.svg"
    },
    "animation":{
        name:"꿈과 동심을 가져다 주는 애니메이션",
        desc:"상상의 세계 속에 푹 빠져 있는 당신! 현실의 힘든 일은 잠시 잊고 꿈과 희망이 풍부한 애니메이션의 세계로 떠나 보는 건 어떤가요? 귀여운 캐릭터들이 전해 주는 교훈과 메세지를 지금 바로 확인해 보세요.",
        rec : [{name:"미야자키 하야오", movie:["센과 치히로의 행방불명","하울의 움직이는 성"]}, {name:"피트 닥터", movie:["인사이드 아웃","소울"]}],
        url:"../../img/animation.svg"
    },
    "documentary":{
        name:"빛나는 눈으로 세상을 탐구하는 다큐멘터리",
        desc:"세상의 이치에 관심이 많고 풍부한 지적 호기심을 가진 당신!  다큐멘터리 장르의 영화가 세상을 보는 통찰력을 길러줄 거예요.",
        rec : [{name:"알레한드로 곤잘레스 아냐리투", movie:["레버넌트"]},],
        url:"../../img/documentary.svg"
    },

    "horror":{
        name:"비명과 함께 스트레스를 날려주는 호러",
        desc:"공포스러운 분위기가 주는 오싹함을 즐기는 당신을 위해 준비했습니다. 온몸에 소름이 끼치고 무서움에 바들바들 떨리지만 그럼에도 멈출 수 없는 중독성을 가진 호러 영화로 스트레스를 날려 버리세요!",
        rec : [{name:"제임스 완", movie:["쏘우","컨저링","인시디어스"]},{name:"조던 필", movie:["겟아웃","어스","놉"]}],
        url:"../../img/horror.svg"
    },



}