const qnaList = [
    {
      q: '드넓은 하얀 설원 속 당신의 눈을 사로 잡은 것은?',
      a:[
        { answer: '나란하게 맞춰 걸은 두 발자국', type: ["로맨스", "드라마"] },
        { answer: '누구의 것인지 알 수 없는 혈흔 자국', type: ["스릴러/액션", "호러"] },
        { answer: '곧 파티가 열린다며 달려오는 토끼', type: ["애니메이션","SF/판타지"] },
      ]
    },
    {
      q: '유투브 프리미엄을 결제한 당신! 지금 당장 보고 싶은 영상은?',
      a: [
        { answer: '사람냄새 가득한 브이로그', type: ["코미디", "드라마"] },
        { answer: '세계 각지에 벌어진 사건사고와  트렌드', type: ["스릴러/액션", "다큐멘터리","호러"] },
        { answer: '어릴 적에 봤던 만화', type: ["애니메이션"] },
      ]
    },
    {
      q: '다음 중 단 한가지만 가질 수 있다면?',
      a: [
        { answer: '사랑과 관계', type: ["로맨스", "드라마"] },
        { answer: '공상과 즐거움', type: ["SF/판타지", "코미디", "애니메이션"] },
        { answer: '커리어 및 명예', type: ["다큐멘터리"] },
      ]
    },
    {
      q: '어두운 골목에 깜박이는 가로등 밑에 있는 것은?',
      a: [
        { answer: '드문 드문 수다 떨며 웃는 두 사람', type: ["코미디", "로맨스", "드라마"] },
        { answer: '차 안에서 잠복 근무하는 형사', type: ["스릴러/액션"] },
        { answer: '밟아도 죽지 않는 벌레', type: ["다큐멘터리", "SF/판타지", "호러"] },
      ]
    },
    {
      q: '오랜만에 외출한 백수인 당신이 간 곳은?',
      a: [
        { answer: '친한 친구의 결혼식', type: ["로맨스", "애니메이션"] },
        { answer: '멸종된 약초가 자라고 있는 뒷동산', type: ["다큐멘터리", "SF/판타지"] },
        { answer: '취한 친구가 자고 있는 경찰서', type: ["스릴러/액션", "코미디"] },
      ]
    },
    {
      q: '긴 휴가를 갖게 된 당신이 선택할 여행지는?',
      a: [
        { answer: '호캉스', type: ["코미디", "드라마"] },
        { answer: '나만 아는 여행지', type: ["다큐멘터리", "SF/판타지"] },
        { answer: '유명한 심령 스팟', type: ["스릴러/액션", "호러"] },
      ]
    },
  {
      q: '놀이공원에 놀러가서 당장 탈 놀이 기구는?',
      a: [
        { answer: '아마존 익스프레스, 스릴라이드, 사파리 투어', type: ["다큐멘터리"] },
        { answer: '롤러코스터, 자이로드랍', type: ["스릴러/액션", "호러"] },
        { answer: '회전목마, 관람차', type: ["코미디", "로맨스", "애니메이션"] },
      ]
    },
  {
      q: '인간인 줄 알았던 상대가 로봇이었다면?',
      a:[
        { answer: '일단 친하게 지낸다.', type: ["로맨스", "애니메이션", "코미디"] },
        { answer: '제보한다.', type: ["스릴러/액션", "SF/판타지"] },
        { answer: '구조가 어떻게 되어 있는지 분해해 본다.', type: ["다큐멘터리"]},
      ]
    },
  
  {
      q: '슈퍼 컴퓨터를 갖게 된 당신이 제일 먼저 하는 일은?',
      a: [
        { answer: '관심있는 사람의 계정을 훔쳐본다.', type: ["로맨스", "드라마"] },
        { answer: '출석 번호를 해킹하여 출석하고 집에서 쉰다.', type: ["SF/판타지", "애니메이션"] },
        { answer: '빼돌리고 팔아서 억만장자가 된다', type: ["다큐멘터리", "호러"] },
      ]
    },
  {
      q: '내 마음대로 내 세계를 재창조 할 수 있다면??',
      a: [
        { answer: '평소 내가 상상하던 나만의 세계로 간다.', type: ["애니메이션", "SF/판타지"] },
        { answer: '내가 이전에 보고 듣고 경험한 것들로 현실을 재구성한다.', type: ["호러", "드라마"] },
        { answer: '현실 세계를 두고 왜 굳이 새로운 세계를 재창초하는가', type: ["다큐멘터리"]},
      ]
    },
  {
      q: '드디어 시험이 끝나 여유로운 당신이 스트레스를 풀고자 하는 일은??',
      a: [
        { answer: '친구들을 만나 재미있는 이야기를 한다.', type: ["코미디", "로맨스"] },
        { answer: '매운 음식을 먹으며 눈물 콧물 쏙 뺀다.', type: ["스릴러/액션", "호러"] },
        { answer: '집으로 가서 홀로 휴식을 취한다.', type: ["애니메이션","드라마"]},
      ]
    },

    {
      q: '영화를 볼 때 가장 중요시 여기는 것은?',
      a: [
        { answer: '탄탄한 스토리와 높은 개연성', type: ["드라마", "로맨스"] },
        { answer: '방대한 스케일과 화려한 특수효과', type: ["SF/판타지"] },
        { answer: '영화 자체가 주는 자극과 즐거움', type: ["스릴러/액션", "호러", "코미디"]},
      ]
    },
]